kurs_de:- findall(X, de(X), All), write(All).
de_rel(C):- findall(X:Y-Z, rel(X,Y,Z), All), write(All).
de('Информация').
de('Информатика').
de('Количество информации').
de('Бит').
de('Алфавит').
de('Знак').
de('Сообщение').
de('Мера информации').
de('Измерение информации').
de('Программирование').
de('').
rel('Информатика','Информация',0.9).
rel('Количество информации','Информация',1).
rel('Количество информации','Алфавит',0.4).
rel('Бит','Информатика',1).
rel('Бит','Количество информации',0.9).
rel('Алфавит','Знак',0.9).
rel('Знак','Количество информации',0.6).
rel('Сообщение','Информация',1).
rel('Мера информации','Количество информации',0.9).
rel('Измерение информации','Информация',1).
rel('Измерение информации','Количество информации',0.7).
